test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba-v2/1000.log
2025/07/07 02:50:20 Function mode: SINGLE
2025/07/07 02:50:20 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1751856620.244412,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/07 02:50:20 Starting func invocation probe for target: appender-ego
2025/07/07 02:50:20 Using rate: 1000
Requests      [total, rate, throughput]         300000, 1000.00, 909.08
Duration      [total, attack, wait]             5m30s, 5m0s, 30.001s
2025/07/07 02:55:50 Shutting down InfluxReporter
Latencies     [min, mean, 50, 90, 95, 99, max]  11.303ms, 23.622ms, 19.717ms, 31.433ms, 42.87ms, 82.959ms, 30.001s
Bytes In      [total, mean]                     332095572, 1106.99
Bytes Out     [total, mean]                     329995600, 1099.99
Success       [ratio]                           100.00%
Status Codes  [code:count]                      0:4  200:299996  
Error Set:
Post "http://appender-ego.default.svc.cluster.local": context deadline exceeded (Client.Timeout exceeded while awaiting headers)
2025/07/07 02:55:50 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 42.870311ms