test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba-v2/250.log
2025/07/07 02:34:18 Function mode: SINGLE
2025/07/07 02:34:18 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1751855658.4028585,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/07 02:34:18 Starting func invocation probe for target: appender-ego
2025/07/07 02:34:18 Using rate: 250
Requests      [total, rate, throughput]         75000, 250.00, 249.99
Duration      [total, attack, wait]             5m0s, 5m0s, 13.105ms
Latencies     [min, mean, 50, 90, 95, 99, max]  11.541ms, 26.792ms, 26.869ms, 31.378ms, 33.29ms, 37.824ms, 191.938ms
Bytes In      [total, mean]                     83025000, 1107.00
Bytes Out     [total, mean]                     82500000, 1100.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:75000  
Error Set:
2025/07/07 02:39:18 Shutting down InfluxReporter
2025/07/07 02:39:18 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 33.290091ms