test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-samba-v2/500.log
2025/07/07 02:39:38 Function mode: SINGLE
2025/07/07 02:39:38 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1751855978.6731791,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/07/07 02:39:38 Starting func invocation probe for target: appender-ego
2025/07/07 02:39:38 Using rate: 500
Requests      [total, rate, throughput]         150000, 500.00, 499.96
Duration      [total, attack, wait]             5m0s, 5m0s, 24.529ms
Latencies     [min, mean, 50, 90, 95, 99, max]  11.344ms, 20.005ms, 19.019ms, 25.913ms, 28.246ms, 32.476ms, 347.025ms
Bytes In      [total, mean]                     166050000, 1107.00
Bytes Out     [total, mean]                     165000000, 1100.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:150000  
Error Set:
2025/07/07 02:44:38 Shutting down InfluxReporter
2025/07/07 02:44:38 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 28.246434ms